import React from 'react';

const Blogs = () => {
    return (
        <div>
            <h2>What is context API</h2>
            <p>রিঅ্যাক্ট কনটেক্সট এপিআই কিছু সময়ের জন্য একটি পরীক্ষামূলক বৈশিষ্ট্য হিসাবে প্রায় ছিল, কিন্তু শুধুমাত্র প্রতিক্রিয়া এর সংস্করণ 16.3.0 এ এটি উৎপাদনে ব্যবহার করা নিরাপদ হয়ে উঠেছে। নীচের নিবন্ধটি আপনাকে দুটি বেসিক ওয়েব স্টোর অ্যাপ দেখাবে, একটি কনটেক্সট এপিআই দিয়ে তৈরি এবং একটি ছাড়াই৷ এই নতুন API একটি প্রধান সমস্যা সমাধান করে - প্রপ ড্রিলিং। এমনকি আপনি এই শব্দটির সাথে পরিচিত না হলেও, আপনি যদি একটি React.js অ্যাপে কাজ করে থাকেন তবে এটি সম্ভবত আপনার সাথে ঘটেছে। প্রপ ড্রিলিং হল মধ্যস্থতাকারী প্রতিক্রিয়া উপাদানগুলির একাধিক স্তরের মধ্য দিয়ে এটিকে কম্পোনেন্ট A থেকে কম্পোনেন্ট Z পর্যন্ত ডেটা পাওয়ার প্রক্রিয়াকরণ। কম্পোনেন্ট পরোক্ষভাবে প্রপস গ্রহণ করবে এবং আপনি, প্রতিক্রিয়া বিকাশকারীকে নিশ্চিত করতে হবে যে সবকিছু সঠিকভাবে কাজ করে। চলুন জেনে নেই কিভাবে আপনি React Context API ছাড়া সাধারণ সমস্যাগুলি পরিচালনা করবেন,</p>
            <h2>Difference between block elements and inline elements</h2>
            <p>
                এইচটিএমএল এর ইনলাইন এবং ব্লক উপাদানগুলি হল একটি গুরুত্বপূর্ণ ক্ষেত্র যেখানে ওয়েব ডেভেলপাররা প্রায়শই বিভ্রান্ত হয়ে পড়েন কারণ তারা কোনটি ইনলাইন এবং ব্লক উপাদানগুলি তা জানতে অক্ষম ছিল যা একটি ওয়েবপেজে আনাড়ির কারণ হতে পারে যদি সে কোনও উপাদানকে ব্লক বলে ধরে নেয় তবে এটি একটি ইনলাইন উপাদান যার কারণে পরবর্তী উপাদান এটির পাশে আসে।

                তাই আসুন HTML-এর ইনলাইন এবং ব্লক উপাদান এবং বিভিন্ন ঘন ঘন ব্যবহৃত ইনলাইন এবং ব্লক এইচটিএমএল উপাদানগুলির মধ্যে পার্থক্য দেখি।
                <li>"h1"-"h6" : এই উপাদানটি বিভিন্ন আকারের শিরোনাম অন্তর্ভুক্ত করার জন্য ব্যবহৃত হয়</li>

                <li>"div": এটি একটি ধারক ট্যাগ এবং ওয়েব পৃষ্ঠায় বিষয়বস্তুর পৃথক বিভাগ করতে ব্যবহৃত হয়। </li>
                <li>"hr": এটি একটি খালি ট্যাগ এবং অনুভূমিক রেখা দ্বারা বিষয়বস্তু আলাদা করার জন্য ব্যবহৃত হয়।</li>

                <li>"p": এই ট্যাগটি ওয়েবপৃষ্ঠার বিষয়বস্তুর অনুচ্ছেদ অন্তর্ভুক্ত করতে ব্যবহৃত হয়।</li>

                <li>" table": This tag is used for including the tables in the webpage when there is a need for tabular data.</li>
            </p>
        </div>
    );
};

export default Blogs;