import React from 'react';

const Blogs = () => {
    return (
        <div>
            <h2 className='font-bold text-3xl ml-96 py-10'>What is context api</h2>
            <h4 className='ml-32 mr-32'>কনটেক্সট এপিআই হল রিঅ্যাক্টের 16.3 সংস্করণে যোগ করা একটি (ধরনের) নতুন বৈশিষ্ট্য যা একজনকে পুরো অ্যাপ জুড়ে (বা এটির অংশ) হালকাভাবে এবং সহজে শেয়ার করতে দেয়। চলুন দেখে নেই কিভাবে ব্যবহার করবেন।
                রিঅ্যাক্ট কনটেক্সট এপিআই হল একটি রিঅ্যাক্ট অ্যাপের জন্য কার্যকরভাবে গ্লোবাল ভেরিয়েবল তৈরি করার একটি উপায় যা চারপাশে পাস করা যেতে পারে। এটি "প্রপ ড্রিলিং" বা দাদা-দাদি থেকে শিশু থেকে পিতা-মাতার কাছে প্রপস সরানোর বিকল্প। রেডক্স ব্যবহার করে রাজ্য পরিচালনার জন্য প্রসঙ্গটিকে একটি সহজ, হালকা পদ্ধতি হিসাবেও উল্লেখ করা হয়।

                কনটেক্সট এপিআই হল রিঅ্যাক্টের 16.3 সংস্করণে যোগ করা একটি (ধরনের) নতুন বৈশিষ্ট্য যা একজনকে পুরো অ্যাপ জুড়ে (বা এটির অংশ) হালকাভাবে এবং সহজে শেয়ার করতে দেয়।
            </h4>
            <h2 className='font-bold text-3xl ml-96 py-10'>What are semantic elements?</h2>
            <h4 className='ml-32 mr-32'>একটি শব্দার্থিক উপাদান হল কোডের একটি উপাদান যা মানুষের ভাষায় সেই উপাদানটিতে কী রয়েছে তা স্পষ্টভাবে উপস্থাপন করতে শব্দ ব্যবহার করে। ব্যবহারিক উদ্দেশ্যে, যারা শব্দার্থিক উপাদান নিয়ে গবেষণা করছেন তাদের অনেকেই শব্দার্থিক লেবেলিংয়ের উদ্দেশ্যে ব্যবহৃত ইংরেজি ভাষার শব্দের দিকে তাকিয়ে আছেন।
                শব্দার্থিক উপাদানগুলির সবচেয়ে বিশিষ্ট উদাহরণগুলির মধ্যে একটি হল ওয়েব পেজ তৈরি করতে ব্যবহৃত HTML 5 প্রোগ্রামিং ভাষা।
                আসল এইচটিএমএল-এ অনেকগুলি শব্দার্থিক উপাদান ছিল যেমন "লিঙ্ক" এবং "img", তবে অন্যান্য উপাদান যা অ-আর্থিক উপাদান ছিল: "div" এবং "span" প্রকৃতপক্ষে ব্যবহারকারীকে উপাদানটি কী তা বলে না বা কিছু বলে না যেমন "a" বা "tr"। অ-অর্থবোধক উপাদানগুলি তাদের বিষয়বস্তু মানব ভাষায় বর্ণনা করে না যে ট্যাগগুলি বিকাশকারীরা তাদের বাস্তবায়নের জন্য ব্যবহার করে৷
            </h4>
        </div>
    );
};

export default Blogs;